app/controllers/notices_controller.rb

  def index
    # We want newer notices to show first. reverse the result server side
    @notices = Notice.all.reverse
---
SELECT "notices".* FROM "notices"

  def create
    @notice = Notice.new(notice_params)

    if @notice.save
---
INSERT INTO "notices" ("title", "author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdf"], ["author", "asdg"], ["content", "asdf"], ["created_at", "2017-09-06 01:00:24.154598"], ["updated_at", "2017-09-06 01:00:24.154598"]]